using Fundamental.Application.Common.Extensions;
using Fundamental.Domain.Symbols.Entities;
using Fundamental.Infrastructure.HostedServices.Codals.CommonJobs;
using Fundamental.Infrastructure.HostedServices.Codals.Manufacturing;
using Fundamental.Infrastructure.Persistence;
using Microsoft.EntityFrameworkCore;
using Microsoft.Extensions.DependencyInjection;
using Microsoft.Extensions.Hosting;

namespace Fundamental.Infrastructure.HostedServices.Codals;

public class CommonCodalDataHostedService(IServiceScopeFactory factory) : BackgroundService
{
    protected override async Task ExecuteAsync(CancellationToken stoppingToken)
    {
        await Task.CompletedTask;

         using IServiceScope scope = factory.CreateScope();
        //  await scope.ServiceProvider.GetRequiredService<UpdateClosePricesDataJob>().Invoke();
        // // await scope.ServiceProvider.GetRequiredService<UpdateCodalPublisherDataJob>().Invoke();
        //  await scope.ServiceProvider.GetRequiredService<UpdateIndexDataJob>().Invoke();
        //  await scope.ServiceProvider.GetRequiredService<UpdateSymbolDataJob>().Invoke();
        // //await scope.ServiceProvider.GetRequiredService<UpdateTseTmcShareHoldersDataJob>().Invoke();

         await scope.ServiceProvider.GetRequiredService<UpdateBalanceSheetDataJob>().Invoke();
        // await scope.ServiceProvider.GetRequiredService<UpdateCapitalIncreaseRegistrationNoticeDataJob>().Invoke();
        // await scope.ServiceProvider.GetRequiredService<UpdateIncomeStatementDataJob>().Invoke();
        // await scope.ServiceProvider.GetRequiredService<UpdateMonthlyActivityDataJob>().Invoke();
        // await scope.ServiceProvider.GetRequiredService<UpdateNonOperationIncomeAndExpensesDataJob>().Invoke();
        // await scope.ServiceProvider.GetRequiredService<UpdateTheStatusOfViableCompanyDataJob>().Invoke();

        await Task.CompletedTask;
    }

    private async Task SeedSectorsAndSymbols(FundamentalDbContext dbContext, CancellationToken stoppingToken)
    {
        var sectorSymbolData = new Dictionary<string, List<string>>
        {
            ["هلدینگها"] = new List<string> { "شستا", "وغدیر", "وامید", "ومعادن", "وصندوق", "وکغدیر", "برکت", "وهنر", "نیرو" },
            ["استخراج سایر معادن"] = new List<string> { "کماسه" },
            ["استخراج کانه های فلزی"] = new List<string> { "کرومیت", "کمنگنز" },
            ["استخراج نفت گاز و خدمات جنبی جز اکتشاف"] = new List<string> { "شساخت", "حفاری" },
            ["اطلاعات و ارتباطات"] = new List<string> { "های وب", "اسیاتک", "فن افزار", "اپرداز", "اوان" },
            ["انبوه سازی، املاک و مستغلات"] = new List<string>
            {
                "ثشاهد", "ثامید", "ثبهساز", "وساخت", "کرمان", "ثمسکن", "ثاخت", "ثباغ", "ثشرق", "وتوس", "ثپردیس", "ثعمرا", "ثجوان", "ثنوسا",
                "آ س پ", "ثجنوب", "وآذر", "ثتران", "ثغرب", "ثالوند", "ثامان", "ثرود", "ثتوسا", "ثنام", "ثعتما", "ثاصفا", "ثاژن", "کیسون",
                "ثقزوی", "ثنظام", "ثزاگرس"
            },
            ["انتشار، چاپ و تکثیر"] = new List<string> { "چافست" },
            ["اوره"] = new List<string> { "شپدیس", "شیراز", "خراسان", "کرماشا", "شلرد", "شاروم" },
            ["آشامیدنی"] = new List<string> { "غبهنوش", "غدیس", "غنوش", "غشهد" },
            ["آلومینیوم"] = new List<string> { "فایرا", "فنوال", "فالوم", "فمراد" },
            ["بانکها"] = new List<string>
            {
                "وبملت", "وپاسار", "وتجارت", "وبصادر", "وپارس", "وشهر", "ونوین", "وخاور", "سامان", "وپست", "وکار", "وسینا", "وگردش",
                "وسالت", "دی", "سمایه", "وملل", "وزمین"
            },
            ["بیمه"] = new List<string>
            {
                "بپاس", "البرز", "کوثر", "ملت", "بساما", "آسیا", "پارسیان", "ودی", "وآفری", "اتکای", "اتکام", "ما", "بنو", "میهن", "وحافظ",
                "ومعلم", "آرمان", "بتهران", "وتعاون", "وسرمد", "بخاور", "نوین", "وفردا", "باران", "ورازی", "آواپارس", "وسین", "وحکمت",
                "کاریز"
            },
            ["پالایشی"] = new List<string> { "شپنا", "شبندر", "شتران", "شبریز", "شاوان", "شراز" },
            ["پلیمر"] = new List<string> { "نوری", "بوعلی", "جم پیلن", "شاراک", "شغدیر", "شبصیر" },
            ["پیمانکاری صنعتی"] = new List<string> { "خصدرا", "بالاس" },
            ["تولید محصولات کامپیوتری الکترونیکی و نوری"] = new List<string> { "مادیرا", "نیان" },
            ["حمل و نقل آبی"] = new List<string> { "حخزر", "حاریا" },
            ["حمل و نقل، انبارداری و ارتباطات"] = new List<string>
            {
                "حکشتی", "حسینا", "حتاید", "حگهر", "حفارس", "توریل", "حآسا", "حآفرین", "حسیر", "حپترو", "حریل", "حتوکا", "حبندر", "حرهشا",
                "حگردش", "حپارسا"
            },
            ["خدمات فنی و مهندسی"] = new List<string> { "رمپنا", "رنیک", "تپولا", "تابا" },
            ["خرده فروشی"] = new List<string> { "افق", "قاسم", "رفاه" },
            ["خودرو"] = new List<string> { "خودرو", "خساپا", "خاور", "خزامیا", "خدیزل", "خپارس", "خاهن", "خکاوه" },
            ["دارویی"] = new List<string>
            {
                "دعبید", "ددانا", "دلر", "دارو", "دفرا", "دالبر", "دپارس", "پخش", "دفارا", "دتماد", "هجرت", "دقاضی", "دسینا", "دتوزیع",
                "دامین", "دسبحان", "دکپسول", "کاسپین", "دجابر", "داسوه", "درهآور", "دشیمی", "دابور", "درازک", "بیوتیک", "دلقما", "ددام",
                "دزهراوی", "دکوثر", "درازی", "دروز", "دتولید", "دیران", "ریشمک", "دسانکو", "داوه", "کی بی سی", "دکیمی", "دحاوی", "دشیری",
                "شتهران", "دتهران"
            },
            ["دوده صنعتی"] = new List<string> { "شکربن", "شصدف", "شدوص" },
            ["رایانه و فعالیتهای وابسته به آن"] = new List<string>
            {
                "سیستم", "رانفور", "سپیدار", "پرداخت", "توسن", "آپ", "پی پاد", "رتاپ", "تاپکیش", "رکیش", "تپسی", "رافزا", "مداران", "افرا",
                "مفاخر", "فن آوا", "سپ"
            },
            ["روانکار"] = new List<string> { "شبهرن", "شسپا", "شنفت", "شرانل", "شزنگ" },
            ["روغن خوراکی"] = new List<string> { "غکورش", "غبشهر", "غناب", "بهپاک", "غدانه", "غپونه" },
            ["زراعت"] = new List<string>
            {
                "سپید", "زپارس", "سیمرغ", "زماهان", "زقیام", "تلیسه", "زدشت", "زفجر", "زگلدشت", "زملارد", "زبینا", "زکشت", "زشگزا", "زمگسا",
                "جوین", "آبین", "زفکا", "زکوثر", "آینده"
            },
            ["زغال سنگ"] = new List<string> { "کزغال", "کربن", "کپرور", "کطبس", "کشرق" },
            ["ساخت دستگاه ها و وسایل ارتباطی"] = new List<string> { "لکما", "لپیام" },
            ["ساخت محصولات فلزی"] = new List<string> { "فاما", "چدن", "فاراک", "فجام", "فلامی", "کیا", "فجوش", "فنرژی", "فکمند" },
            ["سایر محصولات کانی غیر فلزی"] = new List<string>
            {
                "کخاک", "کرازی", "کهمدا", "کگاز", "کتوکا", "کساپا", "کسرا", "کپشیر", "کتوسعه", "کفرا", "کسرام", "کاذر", "کایزد", "کفپارس",
                "کمرجان", "سفارود", "کقزوی", "کفرآور", "کمینا", "ساذری", "سفاسی", "کباده", "سایرا", "شلیا", "کایتا", "سپرمی"
            },
            ["سرب و روی"] = new List<string>
                { "فزر", "کاما", "فاسمین", "کبافق", "فسرب", "فرآور", "کدما", "فزرین", "کیمیا", "فروی", "فسوژ", "فتوسا", "زنگان", "فگستر" },
            ["سرمایه گذاریها"] = new List<string>
            {
                "فارس", "تاپیکو", "پارسان", "میدکو", "تاصیکو", "وبانک", "صبا", "وسپهر", "تیپیکو", "ومهان", "اپال", "ونیکی", "خبهمن",
                "آریان", "تجلی", "خگستر", "وهور", "وپخش", "وسپه", "سیدکو", "وخارزم", "وساپا", "وبشهر", "ورنا", "والبر", "وبهمن", "وپترو",
                "شهر", "کروی", "سمگا", "سرچشمه", "دسبحا", "سغدیر", "وتوکا", "وسنا", "شفا", "ومدیر", "وصنعت", "وسکاب", "وکبهمن", "وتوشه",
                "ختوقا", "وتوسم", "وتوصا", "گوهران", "تبرک", "وارس", "فاذر", "وپویا", "خکرمان", "فافق", "ونفت", "وبیمه", "وسبحان", "وهامون",
                "وبوعلی", "وصنا", "پردیس", "داتام", "فنفت", "وثنو", "شوینده", "وگستر", "اعتلا", "ودانا", "واعتبار", "سدبیر", "واحصا",
                "ولقمان", "وطوبی", "مدیریت", "وآفر", "وآوا", "وثوق", "وجامی", "ومشان", "وفتخار", "وملت", "وپسا", "خودکفا", "وامیر", "تکنار",
                "وسدید", "واحیا", "وتوسکا", "ویسا", "معیار", "سنوین", "بهیر", "وایرا", "وکادو", "وآرین"
            },
            ["سنگ آهن"] = new List<string> { "کگل", "کچاد", "کگهر", "کنور" },
            ["سیم و کابل"] = new List<string> { "بترانس", "بموتو", "بکام", "بکابل", "بالبر", "بکاب", "بایکا", "بتک" },
            ["سیمان"] = new List<string>
            {
                "ستران", "ساوه", "سآبیک", "سخوز", "سصفها", "سفار", "سمازن", "سپاها", "ساروم", "سهرمز", "سهگمت", "ساروج", "سفانو", "ساراب",
                "سصوفی", "سمتاز", "سشرق", "سشمال", "سرود", "اردستان", "ساربیل", "سبجنو", "سجام", "سیلام", "سبهان", "سبزوا", "سغرب", "سقاین",
                "سکرد", "سخزر", "سخاش", "سنیر", "سباقر", "سدور", "سخواف", "سلار", "سکرما", "سکارون"
            },
            ["شوینده"] = new List<string> { "پاکشو", "قرن", "کیمیاتک", "شپاکسا", "شگل", "ساینا", "شپارس" },
            ["شیرینیجات"] = new List<string> { "غصینو", "غپینو", "غسالم", "غویتا", "غگرجی", "غشوکو", "غمینو", "غگز" },
            ["عرضه برق، گاز، بخار و آب گرم"] = new List<string>
                { "مبین", "بفجر", "دماوند", "ونیرو", "بگیلان", "بجهرم", "بمپنا", "بپیوند", "بزاگرس", "آبادا", "بکهنوج" },
            ["غذایی"] = new List<string> { "غزر", "غگل", "غمهرا", "غشهداب", "غچین", "غدشت", "غدام", "غبهار", "غاذر", "زرنام", "غنیلی" },
            ["فعالیت مهندسی، تجزیه، تحلیل و آزمایش فنی"] = new List<string> { "خبازرس" },
            ["فعالیتهای فرهنگی و ورزشی"] = new List<string> { "استقلال", "پرسپولیس" },
            ["فعالیتهای کمکی به نهادهای مالی واسط"] = new List<string>
                { "کالا", "بورس", "لوتوس", "فرابورس", "امین", "امید", "تنوین", "تملت", "تماوند", "تکاردان", "تفارس", "انرژی3" },
            ["فولاد"] = new List<string>
            {
                "فولاد", "فخوز", "فولاژ", "کاوه", "هرمز", "ذوب", "فجهان", "ارفع", "فغدیر", "فخاس", "فصبا", "فسبزوار", "کویر", "فجر",
                "فپنتا", "فاهواز", "فنورد", "فسپا", "فروس", "فروسیل", "فلوله", "فرود", "فسازان", "فولای", "فافزا", "فماک", "فوکا", "فتوان",
                "فروژ", "فسدید"
            },
            ["قطعات خودرو"] = new List<string>
            {
                "خمحرکه", "خبرنا", "خوساز", "خمحور", "خپویش", "ختراک", "خلنت", "خموتور", "خزر", "خکمک", "خمهر", "خفنر", "خچرخش", "خنصیر",
                "خرینگ", "ختور", "خکار", "خشرق", "خاذین", "خعمرا", "تشتاد", "خفناور", "خبنیان", "خریخت", "خلیبل"
            },
            ["قند و شکر"] = new List<string>
            {
                "قهکمت", "قصفها", "قاروم", "قپیرا", "قچار", "قمرو", "قنقش", "قثابت", "قزوین", "قشهد", "قلرست", "قنیشا", "قتربت", "قشیر",
                "قشکر", "قجام", "قیستو", "قشرین"
            },
            ["قیر"] = new List<string> { "شپاس" },
            ["کاشی و سرامیک"] = new List<string> { "کحافظ", "کساوه", "کلوند", "کپارس", "کسعدی", "کترام", "کارام", "کهرام", "کصدف" },
            ["لاستیک و پلاستیک"] = new List<string>
                { "پکرمان", "پکویر", "پارتا", "پتایر", "پیزد", "پاسا", "پسهند", "پلاسک", "پلاست", "پشاهن", "پدرخش", "پلوله" },
            ["لبنیات"] = new List<string>
                { "عالیس", "غالبر", "غشصفا", "غگلپا", "غفارس", "غپآذر", "غشان", "غگلستا", "غشاذر", "غگیلا", "غپاک" },
            ["لوازم خانگی"] = new List<string>
                { "انتخاب", "تایرا", "لبوتان", "گلدیرا", "لپارس", "لخزر", "لابسا", "لازما", "لخانه", "لسرما" },
            ["لیزینگ"] = new List<string>
                { "ولساپا", "ولصنم", "ولبهمن", "ولپارس", "ولتجار", "وایران", "ولکار", "ولملت", "ولراز", "ولغدر", "ولشرق", "ولانا", "ولیز" },
            ["ماشین آلات الکتریکی"] = new List<string> { "بسویچ", "بنیرو", "بشهاب" },
            ["ماشین آلات و تجهیزات"] = new List<string> { "تپمپی", "تکمبا", "تاتمس", "تکشا", "تکنو", "تفیرو", "تپکو", "تمحرکه" },
            ["متانول"] = new List<string> { "زاگرس", "شخارک", "شفن" },
            ["محصولات چوبی"] = new List<string> { "چنوپا", "چخزر", "چفیبر" },
            ["محصولات کاغذی"] = new List<string> { "چکاپا", "لطیف", "چکارن", "چکاوه" },
            ["مخابرات"] = new List<string> { "اخابر" },
            ["مس"] = new List<string> { "فملی", "فباهنر" },
            ["مواد شیمیایی"] = new List<string>
            {
                "آریا", "مارون", "پارس", "جم", "شگویا", "شیران", "شاملا", "شصفها", "شجم", "شکلر", "کلر", "شکام", "شفارا", "دهدشت", "شفارس",
                "شپترو", "شسینا", "زنجان", "شمواد", "شملی", "شلعاب", "شتوکا", "داراب", "فسا", "جهرم", "شسم", "شکبیر", "شرنگی", "شپلی",
                "ممسنی", "شتولی", "شکف", "کازرو", "بهداش", "شگامرن"
            },
            ["نساجی"] = new List<string> { "نخریس", "نمرینو", "نطرین", "نبروج", "نتوس", "نشار" },
            ["هتل و رستوران"] = new List<string> { "گدنا", "گپارس", "آباد", "گکیش", "گنگین" },
        };

        foreach (var sectorData in sectorSymbolData)
        {
            var sectorName = sectorData.Key.Safe();
            var sector = await dbContext.Sectors.FirstOrDefaultAsync(s => s.Name == sectorName, stoppingToken);

            if (sector == null)
            {
                sector = new Sector(Guid.NewGuid(), sectorName, DateTime.UtcNow);
                dbContext.Sectors.Add(sector);
                await dbContext.SaveChangesAsync(stoppingToken);
            }

            foreach (var symbolName in sectorData.Value)
            {
                var symbol = await dbContext.Symbols.FirstOrDefaultAsync(s => s.Name == symbolName.Safe(), stoppingToken);

                if (symbol != null && symbol.Sector?.Id != sector.Id)
                {
                    symbol.Sector = sector;
                    await dbContext.SaveChangesAsync(stoppingToken);
                }
            }
        }
    }
}