using Fundamental.BuildingBlock;

namespace BuildingBlockUnitTests;

public class SymbolExtensionsTest
{
    [Theory]
    [InlineData(
        @"کادر توضیحی مربوط به اطلاعات دوره ۱ ماهه منتهی به ۱۴۰۳/۱۱/۳۰
-فروش طلا اعم از شمش و مصنوعات در شرکت استحصال مواد معدنی تخت سلیمان (شرکت تابعه) در بهمن ماه ۱۴۰۳ مبلغ ۱،۶۴۵ میلیارد ریال است.
کادر توضیحی مربوط اطلاعات تجمعی از ابتدای سال تا پایان مورخ ۱۴۰۳/۱۱/۳۰
مجموع فروش طلا اعم از شمش و مصنوعات در شرکت استحصال مواد معدنی تخت سلیمان (شرکت تابعه) تا پایان بهمن ماه ۱۴۰۳ مبلغ ۲،۲۶۵ میلیارد ریال است.",
        1645000,
        2265000)]
    [InlineData(
        @"
کادر توضیحات در مورد اصلاحات
کادر توضیحی مربوط به اطلاعات دوره ۱ ماهه منتهی به ۱۴۰۳/۰۷/۳۰
فروش طلا اعم از شمش و مصنوعات در شرکت استحصال مواد معدنی تخت سلیمان(شرکت تابعه) در مهر ماه ۱۴۰۳ مبلغ ۴،۷۳۹ میلیارد ریال است.
کادر توضیحی مربوط اطلاعات تجمعی از ابتدای سال تا پایان مورخ ۱۴۰۳/۰۷/۳۰
مجموع فروش طلا اعم از شمش و مصنوعات در شرکت استحصال مواد معدنی تخت سلیمان(شرکت تابعه) تا پایان مهرماه ۱۴۰۳ مبلغ ۳۱،۵۴۵ میلیارد ریال است.",
        4739000,
        31545000)]
    [InlineData(
        @"کادر توضیحات در مورد اصلاحات
کادر توضیحی مربوط به اطلاعات دوره ۱ ماهه منتهی به ۱۴۰۳/۰۹/۳۰
۱-در خصوص كانسنگ طلا با عيار ۰/۳۷۵۹ گرم بر تن : مقدار فروش رفته فوق از محل دپوي كانسنگ باطله سال هاي قبل و طبق مجوز اخذ شده از سازمان صمت آ.غ ، حمل و به فروش رفته است. ۲-فروش طلا اعم از شمش و مصنوعات در شرکت استحصال مواد معدنی تخت سلیمان (شرکت تابعه) در آذر ماه ۱۴۰۳ مبلغ ۱،۵۹۶ میلیارد ریال است.
کادر توضیحی مربوط اطلاعات تجمعی از ابتدای سال تا پایان مورخ ۱۴۰۳/۰۹/۳۰
مجموع فروش طلا اعم از شمش و مصنوعات در شرکت استحصال مواد معدنی تخت سلیمان (شرکت تابعه) تا پایان آذر ماه ۱۴۰۳ مبلغ ۳۵،۳۷۰ میلیارد ریال است.",
        1596000,
        35370000)]
    [InlineData(
        @"کادر توضیحی مربوط به اطلاعات دوره ۱ ماهه منتهی به ۱۴۰۳/۱۰/۳۰
۱-در خصوص كانسنگ طلا با عيار ۰/۳۷۵۹ گرم بر تن : مقدار فروش رفته فوق از محل دپوي كانسنگ باطله سال هاي قبل و طبق مجوز اخذ شده از سازمان صمت آ.غ ، حمل و به فروش رفته است.
کادر توضیحی مربوط اطلاعات تجمعی از ابتدای سال تا پایان مورخ ۱۴۰۳/۱۰/۳۰",
        0,
        0)]
    [InlineData(
        @"کادر توضیحی مربوط به اطلاعات دوره ۱ ماهه منتهی به ۱۴۰۳/۱۰/۳۰
۲-فروش طلا اعم از شمش و مصنوعات در شرکت استحصال مواد معدنی تخت سلیمان (شرکت تابعه) در دی ماه ۱۴۰۳ مبلغ ۶۲۰ میلیارد ریال است.
کادر توضیحی مربوط اطلاعات تجمعی از ابتدای سال تا پایان مورخ ۱۴۰۳/۱۰/۳۰",
        620000,
        0)]
    [InlineData(
        @"

کادر توضیحی مربوط به اطلاعات دوره ۱ ماهه منتهی به ۱۴۰۳/۱۰/۳۰
۱-در خصوص كانسنگ طلا با عيار ۰/۳۷۵۹ گرم بر تن : مقدار فروش رفته فوق از محل دپوي كانسنگ باطله سال هاي قبل و طبق مجوز اخذ شده از سازمان صمت آ.غ ، حمل و به فروش رفته است.۲-فروش طلا اعم از شمش و مصنوعات در شرکت استحصال مواد معدنی تخت سلیمان (شرکت تابعه) در دی ماه ۱۴۰۳ مبلغ ۶۲۰ میلیارد ریال است.
کادر توضیحی مربوط اطلاعات تجمعی از ابتدای سال تا پایان مورخ ۱۴۰۳/۱۰/۳۰
",
        620000,
        0)]
    [InlineData("", 0, 0)]
    public void ExtractFezarInfo_ExtractsSalesAmounts(string reportText, decimal expectedMonthlySales, decimal expectedCumulativeSales)
    {
        // Act
        SymbolExtensions.SalesInfo result = SymbolExtensions.ExtractFezarInfo(reportText);

        // Assert
        Assert.Equal(expectedMonthlySales, result.MonthlySales);
        Assert.Equal(expectedCumulativeSales, result.CumulativeSales);
    }
}